In [1]:
import pandas as pd

In [39]:
df = pd.read_csv('https://people.sc.fsu.edu/~jburkardt/data/csv/biostats.csv')
df

    Name       "Sex"   "Age"   "Height (in)"   "Weight (lbs)"
0   Alex         "M"      41              74              170
1   Bert         "M"      42              68              166
2   Carl         "M"      32              70              155
3   Dave         "M"      39              72              167
4   Elly         "F"      30              66              124
5   Fran         "F"      33              66              115
6   Gwen         "F"      26              64              121
7   Hank         "M"      30              71              158
8   Ivan         "M"      53              72              175
9   Jake         "M"      32              69              143
10  Kate         "F"      47              69              139
11  Luke         "M"      34              72              163
12  Myra         "F"      23              62               98
13  Neil         "M"      36              75              160
14  Omar         "M"      38              70              145
15  Page         "F"      31              67              135
16  Quin         "M"      29              71              176
17  Ruth         "F"      28              65              131

In [3]:
df.columns

Index(['Name', '     "Sex"', ' "Age"', ' "Height (in)"', ' "Weight (lbs)"'], dtype='object')

In [40]:
df.columns = ['Name', 'Sex', 'Age', 'Height (in)', 'Weight (lbs)']
df.head()

   Name         Sex  Age  Height (in)  Weight (lbs)
0  Alex         "M"   41           74           170
1  Bert         "M"   42           68           166
2  Carl         "M"   32           70           155
3  Dave         "M"   39           72           167
4  Elly         "F"   30           66           124

In [23]:
df['Name']

0     Alex
1     Bert
2     Carl
3     Dave
4     Elly
5     Fran
6     Gwen
7     Hank
8     Ivan
9     Jake
10    Kate
11    Luke
12    Myra
13    Neil
14    Omar
15    Page
16    Quin
17    Ruth
Name: Name, dtype: object

In [24]:
df[['Name', 'Height (in)']]

    Name  Height (in)
0   Alex           74
1   Bert           68
2   Carl           70
3   Dave           72
4   Elly           66
5   Fran           66
6   Gwen           64
7   Hank           71
8   Ivan           72
9   Jake           69
10  Kate           69
11  Luke           72
12  Myra           62
13  Neil           75
14  Omar           70
15  Page           67
16  Quin           71
17  Ruth           65

In [25]:
type(df[['Name', 'Sex']])

pandas.core.frame.DataFrame

In [26]:
df.iloc[0]  # iloc is used for ingerger indices

Name                  Alex
Sex                    "M"
Age                     41
Height (in)             74
Weight (lbs)           170
Name: 0, dtype: object

In [27]:
df.loc[0] # loc selects by index lable

Name                  Alex
Sex                    "M"
Age                     41
Height (in)             74
Weight (lbs)           170
Name: 0, dtype: object

In [30]:
df2 = pd.read_csv('https://people.sc.fsu.edu/~jburkardt/data/csv/biostats.csv', index_col='Name')
df2

           "Sex"   "Age"   "Height (in)"   "Weight (lbs)"
Name
Alex         "M"      41              74              170
Bert         "M"      42              68              166
Carl         "M"      32              70              155
Dave         "M"      39              72              167
Elly         "F"      30              66              124
Fran         "F"      33              66              115
Gwen         "F"      26              64              121
Hank         "M"      30              71              158
Ivan         "M"      53              72              175
Jake         "M"      32              69              143
Kate         "F"      47              69              139
Luke         "M"      34              72              163
Myra         "F"      23              62               98
Neil         "M"      36              75              160
Omar         "M"      38              70              145
Page         "F"      31              67              135
Quin         "M"      29              71              176
Ruth         "F"      28              65              131

In [31]:
df.loc['Hank']

     "Sex"                "M"
 "Age"                     30
 "Height (in)"             71
 "Weight (lbs)"           158
Name: Hank, dtype: object

In [32]:
type(df.loc['Hank'])

pandas.core.series.Series

In [41]:
df[df['Height (in)'] > 70]

    Name         Sex  Age  Height (in)  Weight (lbs)
0   Alex         "M"   41           74           170
3   Dave         "M"   39           72           167
7   Hank         "M"   30           71           158
8   Ivan         "M"   53           72           175
11  Luke         "M"   34           72           163
13  Neil         "M"   36           75           160
16  Quin         "M"   29           71           176

In [45]:
df[df['Sex'] != 'M']

    Name         Sex  Age  Height (in)  Weight (lbs)
0   Alex         "M"   41           74           170
1   Bert         "M"   42           68           166
2   Carl         "M"   32           70           155
3   Dave         "M"   39           72           167
4   Elly         "F"   30           66           124
5   Fran         "F"   33           66           115
6   Gwen         "F"   26           64           121
7   Hank         "M"   30           71           158
8   Ivan         "M"   53           72           175
9   Jake         "M"   32           69           143
10  Kate         "F"   47           69           139
11  Luke         "M"   34           72           163
12  Myra         "F"   23           62            98
13  Neil         "M"   36           75           160
14  Omar         "M"   38           70           145
15  Page         "F"   31           67           135
16  Quin         "M"   29           71           176
17  Ruth         "F"   28           65           131

In [46]:
df['Sex'] != 'M'

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
10    True
11    True
12    True
13    True
14    True
15    True
16    True
17    True
Name: Sex, dtype: bool

In [47]:
type(df['Sex'] != 'M')

pandas.core.series.Series

In [51]:
import numpy as np
A = np.arange(17)
A

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16])

In [52]:
A[A % 2 ==0]

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16])

In [53]:
df.values

array([['Alex', '       "M"', 41, 74, 170],
       ['Bert', '       "M"', 42, 68, 166],
       ['Carl', '       "M"', 32, 70, 155],
       ['Dave', '       "M"', 39, 72, 167],
       ['Elly', '       "F"', 30, 66, 124],
       ['Fran', '       "F"', 33, 66, 115],
       ['Gwen', '       "F"', 26, 64, 121],
       ['Hank', '       "M"', 30, 71, 158],
       ['Ivan', '       "M"', 53, 72, 175],
       ['Jake', '       "M"', 32, 69, 143],
       ['Kate', '       "F"', 47, 69, 139],
       ['Luke', '       "M"', 34, 72, 163],
       ['Myra', '       "F"', 23, 62, 98],
       ['Neil', '       "M"', 36, 75, 160],
       ['Omar', '       "M"', 38, 70, 145],
       ['Page', '       "F"', 31, 67, 135],
       ['Quin', '       "M"', 29, 71, 176],
       ['Ruth', '       "F"', 28, 65, 131]], dtype=object)

In [55]:
A = df[['Name','Sex']].values
A

array([['Alex', '       "M"'],
       ['Bert', '       "M"'],
       ['Carl', '       "M"'],
       ['Dave', '       "M"'],
       ['Elly', '       "F"'],
       ['Fran', '       "F"'],
       ['Gwen', '       "F"'],
       ['Hank', '       "M"'],
       ['Ivan', '       "M"'],
       ['Jake', '       "M"'],
       ['Kate', '       "F"'],
       ['Luke', '       "M"'],
       ['Myra', '       "F"'],
       ['Neil', '       "M"'],
       ['Omar', '       "M"'],
       ['Page', '       "F"'],
       ['Quin', '       "M"'],
       ['Ruth', '       "F"']], dtype=object)

In [56]:
type(A)

numpy.ndarray

In [57]:
smalldf = df[['Name','Sex']]
smalldf.to_csv('output.csv')

In [58]:
pd.read_csv('output.csv')

    Unnamed: 0  Name         Sex
0            0  Alex         "M"
1            1  Bert         "M"
2            2  Carl         "M"
3            3  Dave         "M"
4            4  Elly         "F"
5            5  Fran         "F"
6            6  Gwen         "F"
7            7  Hank         "M"
8            8  Ivan         "M"
9            9  Jake         "M"
10          10  Kate         "F"
11          11  Luke         "M"
12          12  Myra         "F"
13          13  Neil         "M"
14          14  Omar         "M"
15          15  Page         "F"
16          16  Quin         "M"
17          17  Ruth         "F"

In [59]:
smalldf.to_csv('output.csv', index=False)

In [60]:
pd.read_csv('output.csv')

    Name         Sex
0   Alex         "M"
1   Bert         "M"
2   Carl         "M"
3   Dave         "M"
4   Elly         "F"
5   Fran         "F"
6   Gwen         "F"
7   Hank         "M"
8   Ivan         "M"
9   Jake         "M"
10  Kate         "F"
11  Luke         "M"
12  Myra         "F"
13  Neil         "M"
14  Omar         "M"
15  Page         "F"
16  Quin         "M"
17  Ruth         "F"